---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveElemArcRadius
source: html/e0491a1e-3bb8-b293-da1c-4b56228bb9c0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveElemArcRadius Property

"Radius"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveElemArcRadius { get; }
```